insert into hobby (category, name)
values
    ('운동', '헬스'),
    ('운동', '러닝'),
    ('운동', '등산'),
    ('운동', '요가'),
    ('운동', '필라테스'),
    ('운동', '골프'),
    ('운동', '테니스'),
    ('문화', '영화'),
    ('문화', '전시'),
    ('문화', '공연'),
    ('문화', '독서'),
    ('문화', '음악'),
    ('라이프', '맛집'),
    ('라이프', '카페'),
    ('라이프', '여행'),
    ('라이프', '요리'),
    ('라이프', '반려동물'),
    ('취향', '게임'),
    ('취향', '사진'),
    ('취향', '드라이브'),
    ('취향', '와인'),
    ('취향', '캠핑')
on duplicate key update
    category = values(category);
